{
    "Sad": [
      "Do not despair of the mercy of Allah. (Surah Az-Zumar 39:53)",
      "Indeed, with hardship comes ease. (Surah Ash-Sharh 94:6)",
      "So truly, where there is hardship, there is also ease. (Surah Ash-Sharh 94:5)",
      "And it is He who heals the breasts of the believers. (Surah At-Tawbah 9:14)",
      "Do not grieve; indeed, Allah is with us. (Surah At-Tawbah 9:40)",
      "Say, 'My Lord, forgive me and have mercy, and You are the best of the merciful.' (Surah Al-Mu’minun 23:118)",
      "Indeed, Allah is with those who fear Him and those who are doers of good. (Surah An-Nahl 16:128)",
      "And whoever fears Allah... He will make a way for him to get out (from every difficulty). (Surah At-Talaq 65:2)",
      "Your ally is none but Allah and His Messenger and those who have believed – those who establish prayer and give zakah, and they bow. (Surah Al-Ma’idah 5:55)",
      "And know that Allah is with the righteous. (Surah At-Tawbah 9:36)",
      "So be patient. Indeed, the promise of Allah is truth. (Surah Ar-Rum 30:60)",
      "Indeed, your ally is Allah, and His Messenger, and those who have believed – those who establish prayer and give zakah, and they bow. (Surah Al-Ma'idah 5:55)",
      "Say, 'My Lord, increase me in knowledge.' (Surah Taha 20:114)",
      "Indeed, Allah commands you to give the trusts to whom they are due and when you judge between people to judge with justice. (Surah An-Nisa 4:58)",
      "Do not kill the soul which Allah has forbidden, except by right. (Surah Al-Isra 17:33)",
      "Indeed, Allah is with those who fear Him and those who are doers of good. (Surah An-Nahl 16:128)",
      "Indeed, Allah is the best of providers. (Surah Al-Jumu'ah 62:11)",
      "And He found you poor and made [you] self-sufficient. (Surah Ad-Duha 93:8)",
      "Indeed, with every difficulty, there is relief. (Surah Ash-Sharh 94:6)",
      "And We will surely give you [O Muhammad] something of what they have been promised. (Surah Ash-Sharh 94:7)"
    ],
    "Happy": [
      "Say, 'In the bounty of Allah and in His mercy—in that let them rejoice; it is better than what they accumulate.' (Surah Yunus 10:58)",
      "Indeed, Allah is the Protector of those who have faith. He brings them out of the depths of darkness into light. (Surah Al-Baqarah 2:257)",
      "And We have certainly honored the children of Adam. (Surah Al-Isra 17:70)",
      "Say, 'In the grace of Allah and in His mercy – let them rejoice; it is better than what they accumulate.' (Surah Yunus 10:58)",
      "For indeed, the mercy of Allah is near to the doers of good. (Surah Al-A'raf 7:56)",
      "Allah is the best of planners. (Surah Al-Imran 3:54)",
      "Indeed, those who have believed and done righteous deeds – the Most Merciful will appoint for them affection. (Surah Maryam 19:96)",
      "And those who believe and do righteous deeds – We will admit them to gardens beneath which rivers flow, abiding therein forever. (Surah An-Nisa 4:57)",
      "And He found you lost and guided [you]. (Surah Ad-Duha 93:7)",
      "Indeed, with every difficulty, there is relief. (Surah Ash-Sharh 94:6)",
      "Indeed, with the remembrance of Allah do hearts find rest. (Surah Ar-Ra'd 13:28)",
      "And He is the Forgiving, full of love. (Surah Al-Buruj 85:14)",
      "And those who believed and did righteous deeds – We will admit them to gardens beneath which rivers flow, abiding therein forever. (Surah Al-Kahf 18:107)",
      "If you give thanks, I will give you more. (Surah Ibrahim 14:7)",
      "And He will provide him from where he does not expect. (Surah At-Talaq 65:3)",
      "Allah is the best of planners. (Surah Al-Imran 3:54)",
      "Indeed, those who believe and do righteous deeds – the Most Merciful will appoint for them affection. (Surah Maryam 19:96)",
      "Indeed, Allah is the best of providers. (Surah Al-Jumu'ah 62:11)",
      "Do not grieve. Indeed, Allah is with us. (Surah At-Tawbah 9:40)",
      "Say, 'Call upon Allah or call upon the Most Merciful. Whatever [you call – to Him belong] the best names.' (Surah Al-Isra 17:110)"
    ],
    "Angry": [
      "And when they are angry, they forgive. (Surah Ash-Shura 42:37)",
      "Indeed, Allah loves those who control their anger. (Surah Al-Imran 3:134)",
      "The strong man is not the one who is able to overpower others, but the one who controls himself when angry. (Hadith, Sahih al-Bukhari)",
      "If you punish, then punish with an equivalent of that with which you were harmed. (Surah An-Nahl 16:126)",
      "And lower to them the wing of humility out of mercy and say, 'My Lord, have mercy upon them as they brought me up [when I was] small.' (Surah Al-Isra 17:24)",
      "Good and evil are not equal. Repel [evil] by that which is better, and you will see that the one whom you had as an enemy will become as though he was a close friend. (Surah Fussilat 41:34)",
      "If a wound has touched you, then a wound has touched them as well. And We have not sent you [O Muhammad] except as a mercy to the worlds. (Surah Al-Furqan 25:20)",
      "Hold to forgiveness, command what is right, and turn away from the ignorant. (Surah Al-A’raf 7:199)",
      "And if you are greeted with a greeting, greet with a better greeting or return it in kind. (Surah An-Nisa 4:86)",
      "Repel evil with good. (Surah Fussilat 41:34)",
      "Do not be sad; indeed, Allah is with us. (Surah At-Tawbah 9:40)",
      "Control your anger and forgive the people. (Surah Ash-Shura 42:37)",
      "And those who, when they are reminded of the verses of their Lord, do not fall upon them deaf and blind. (Surah Al-Furqan 25:73)",
      "Let them forgive and overlook. (Surah Ash-Shura 42:40)",
      "And He will guide them to His way. (Surah Al-A'raf 7:43)",
      "He who is patient and forgives – indeed, that is of the matters [worthy] of resolve. (Surah Ash-Shura 42:43)",
      "And be kind to parents. (Surah Al-Isra 17:23)",
      "And lower to them the wing of humility out of mercy. (Surah Al-Isra 17:24)",
      "And those who, when they are reminded of the verses of their Lord, do not fall upon them deaf and blind. (Surah Al-Furqan 25:73)",
      "And when they are angry, they forgive. (Surah Ash-Shura 42:37)"
    ],
    "Alone": [
      "Indeed, My Lord is near and responsive. (Surah Hud 11:61)",
      "And remember your Lord when you forget. (Surah Al-Kahf 18:24)",
      "And We have certainly created man, and We know what his soul whispers to him. (Surah Qaf 50:16)",
      "So truly, with hardship, there is relief. (Surah Ash-Sharh 94:6)",
      "You are never alone. Allah is always with you. (Hadith, Sahih Muslim)",
      "Indeed, Allah is with those who fear Him and those who are doers of good. (Surah An-Nahl 16:128)",
      "Do not grieve. Indeed, Allah is with us. (Surah At-Tawbah 9:40)",
      "Your ally is none but Allah and His Messenger and those who have believed – those who establish prayer and give zakah, and they bow. (Surah Al-Ma’idah 5:55)",
      "Say, 'Call upon Allah or call upon the Most Merciful. Whatever [you call – to Him belong] the best names.' (Surah Al-Isra 17:110)",
      "Indeed, with every difficulty, there is relief. (Surah Ash-Sharh 94:6)",
      "Indeed, He is the Most Merciful. (Surah Al-Furqan 25:20)",
      "And He is with you wherever you may be. (Surah Al-Mujadila 58:7)",
      "And He will forgive you, for He is the Forgiving, full of mercy. (Surah Al-A'raf 7:156)",
      "So be patient. Indeed, the promise of Allah is truth. (Surah Ar-Rum 30:60)",
      "Indeed, Allah is with the righteous. (Surah At-Tawbah 9:36)",
      "Do not grieve; indeed, Allah is with us. (Surah At-Tawbah 9:40)",
      "And We have certainly made the Qur'an easy to remember. (Surah Al-Qamar 54:40)",
      "And Allah is the best of providers. (Surah Al-Jumu'ah 62:11)",
      "Say, 'Call upon Allah or call upon the Most Merciful. Whatever [you call – to Him belong] the best names.' (Surah Al-Isra 17:110)"
    ]
  }
  